[
  {
    "ID":1,
    "Personaggio\/soggetto":"André e Wally B.",
    "Film\/corto":"The adventures of André and Wally B.",
    "Anno":1984,
    "Regista\/autore":"Alvy Ray Smith (regista)",
    "Trama":"Il cortometraggio si apre con il protagonista, André, che si sta godendo un sereno pisolino in una radura luminosa e boscosa. La sua quiete viene bruscamente interrotta dall'arrivo di Wally B., un'ape determinata e vivace.\n\nAndré tenta immediatamente di sfuggire all'ape che lo molesta, dando il via a un frenetico inseguimento in cui i due personaggi si muovono rapidamente tra il paesaggio stilizzato. Il design e l'animazione furono rivoluzionari per l'epoca, esplorando per la prima volta tecniche di motion blur per rendere il movimento più dinamico e veloce.\n\nDopo un inseguimento concitato, Wally B. riesce quasi a raggiungere André, ma il suo tentativo di pungere fallisce: l'ape si schianta contro un tronco d'albero, deformando il suo pungiglione. Mentre l'ape, confusa, si allontana, André conclude il breve scontro lanciandole il suo cappellino, che colpisce Wally B. in volo.",
    "Link 1":"Cortometraggio: https:\/\/youtu.be\/a_9Tsbduk9E?si=4G6ra-9edkJfziRP",
    "Link 2":"https:\/\/youtu.be\/LT3c0ZYvBCY?si=qJBETrRUCaqG9k1T",
    "Link 3":null,
    "Categoria Innovazione (tag)":"Movimento",
    "Nome Innovazione":"Forma a goccia (squash and stretch)",
    "Paragrafo descrizione innovazione":"Il programma di modellazione utilizzato all'epoca poteva produrre solo semplici forme geometriche primitive (coni, cubi, sfere, cilindri, toppe, linee, ecc.), nonostante John Lasseter desiderasse una forma a pera flessibile per il corpo di André e i piedi di Wally B., come si trova nella maggior parte dei personaggi dei cartoni animati. Ed Catmull alla fine riuscì a creare una forma a goccia ottenuta utilizzando due sfere tagliate a metà e realizzate in dimensioni diverse, e il computer riempì la sezione centrale, mentre Ed inserì i controlli per distorcerle e piegarle in modi diversi.",
    "Funzionamento - info maggiorni su tecnologie":"I personaggi, specialmente André, venivano deformati ed esagerati per esprimere il movimento e l'emozione, proprio come nei principi fondamentali dell'animazione tradizionale Disney. Questo conferì ai modelli 3D una flessibilità e una vitalità mai viste prima. Per la prima volta, un modello poligonale (André) poteva essere animato attraverso uno \"scheletro\" digitale o sistema di \"articolazioni virtuali\", rendendo possibili movimenti più naturali e complessi (come correre e piegarsi).",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":2,
    "Personaggio\/soggetto":"André e Wally B.",
    "Film\/corto":"The adventures of André and Wally B.",
    "Anno":1984,
    "Regista\/autore":"Alvy Ray Smith (regista)",
    "Trama":"Il cortometraggio si apre con il protagonista, André, che si sta godendo un sereno pisolino in una radura luminosa e boscosa. La sua quiete viene bruscamente interrotta dall'arrivo di Wally B., un'ape determinata e vivace.\n\nAndré tenta immediatamente di sfuggire all'ape che lo molesta, dando il via a un frenetico inseguimento in cui i due personaggi si muovono rapidamente tra il paesaggio stilizzato. Il design e l'animazione furono rivoluzionari per l'epoca, esplorando per la prima volta tecniche di motion blur per rendere il movimento più dinamico e veloce.\n\nDopo un inseguimento concitato, Wally B. riesce quasi a raggiungere André, ma il suo tentativo di pungere fallisce: l'ape si schianta contro un tronco d'albero, deformando il suo pungiglione. Mentre l'ape, confusa, si allontana, André conclude il breve scontro lanciandole il suo cappellino, che colpisce Wally B. in volo.",
    "Link 1":"Cortometraggio: https:\/\/youtu.be\/a_9Tsbduk9E?si=4G6ra-9edkJfziRP",
    "Link 2":"https:\/\/youtu.be\/LT3c0ZYvBCY?si=qJBETrRUCaqG9k1T",
    "Link 3":null,
    "Categoria Innovazione (tag)":"Movimento",
    "Nome Innovazione":"Motion Blur",
    "Paragrafo descrizione innovazione":"Per rendere il movimento della corsa di André e del volo di Wally B. incredibilmente veloce e dinamico, il team implementò per la prima volta un \"motion blur\" generato dal computer. Questo effetto simula ciò che accade con una telecamera reale ad alta velocità: gli oggetti in rapido movimento appaiono sfocati, ingannando l'occhio e aumentando la percezione della velocità sullo schermo in modo molto più efficace rispetto a un'immagine semplicemente spostata.",
    "Funzionamento - info maggiorni su tecnologie":null,
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":3,
    "Personaggio\/soggetto":"Collina con alberi",
    "Film\/corto":"The adventures of André and Wally B.",
    "Anno":1984,
    "Regista\/autore":"Alvy Ray Smith (regista)",
    "Trama":"Il cortometraggio si apre con il protagonista, André, che si sta godendo un sereno pisolino in una radura luminosa e boscosa. La sua quiete viene bruscamente interrotta dall'arrivo di Wally B., un'ape determinata e vivace.\n\nAndré tenta immediatamente di sfuggire all'ape che lo molesta, dando il via a un frenetico inseguimento in cui i due personaggi si muovono rapidamente tra il paesaggio stilizzato. Il design e l'animazione furono rivoluzionari per l'epoca, esplorando per la prima volta tecniche di motion blur per rendere il movimento più dinamico e veloce.\n\nDopo un inseguimento concitato, Wally B. riesce quasi a raggiungere André, ma il suo tentativo di pungere fallisce: l'ape si schianta contro un tronco d'albero, deformando il suo pungiglione. Mentre l'ape, confusa, si allontana, André conclude il breve scontro lanciandole il suo cappellino, che colpisce Wally B. in volo.",
    "Link 1":"Cortometraggio: https:\/\/youtu.be\/a_9Tsbduk9E?si=4G6ra-9edkJfziRP",
    "Link 2":"https:\/\/youtu.be\/LT3c0ZYvBCY?si=qJBETrRUCaqG9k1T",
    "Link 3":null,
    "Categoria Innovazione (tag)":"Sfondo",
    "Nome Innovazione":"Sistemi di particelle",
    "Paragrafo descrizione innovazione":"Bill Reeves aveva ideato questo sistema che era capace di creare e controllare milioni di singole particelle per costruire oggetti più grandi così da poter far sembrare el cortometraggio che ci fossero milioni di foglie nella collina piena di alberi.",
    "Funzionamento - info maggiorni su tecnologie":null,
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":4,
    "Personaggio\/soggetto":"Luxo Jr. e Luxo Sr.",
    "Film\/corto":"Luxo Jr.",
    "Anno":1986,
    "Regista\/autore":"John Lassater",
    "Trama":"In una stanza buia, una grande lampada da tavolo di nome Luxo vede una piccola palla che rotola verso di lui. La guarda con curiosità e la spinge via, ma la palla torna da lui. La spinge via di nuovo, ma la palla gli rotola accanto mentre Luxo Junior, il suo vivace figlio, salta e gioca con la palla. Luxo Junior quindi si bilancia sulla palla e la schiaccia, facendola sgonfiare. Dopodiché capovolge la palla sgonfia su un lato e guarda Luxo, che ammonisce gentilmente suo figlio. Luxo Junior quindi salta fuori dallo schermo per la vergogna, ma in seguito viene visto giocare con una palla da spiaggia. Luxo guarda la telecamera, quindi scuote la testa imbarazzato.",
    "Link 1":"Cortometraggio: https:\/\/youtu.be\/6G3O60o5U7w?si=7oDmJj0wHMYZjUtN",
    "Link 2":"https:\/\/youtu.be\/MJQRVKtwr70?si=M7lbt33BfbXz8I09",
    "Link 3":null,
    "Categoria Innovazione (tag)":"Luci",
    "Nome Innovazione":"Self-shadowing",
    "Paragrafo descrizione innovazione":"Il Self-Shadowing (Auto-Ombreggiamento) è una tecnica di rendering che permette a un oggetto 3D di proiettare ombre su sé stesso. In \"Luxo Jr.\", questa non fu solo un'aggiunta estetica, ma un elemento cruciale per dare vita ai personaggi. È stato reso possibile dall'uso di algoritmi avanzati di Ray Tracing o tecniche di Mappatura delle Ombre (Shadow Mapping) implementate dal team Pixar e ha permesso di vedere le ombre proiettate dal paralume e dagli snodi articolati della lampada sulla sua base e sui suoi bracci, rendendo Luxo Sr. e Luxo Jr. fisicamente credibili e con una massa percepita, trasformando semplici modelli geometrici in \"personaggi\" tangibili.",
    "Funzionamento - info maggiorni su tecnologie":"Luxo Jr. fu un cortometraggio fondamentale per l’animazione procedurale. Le superfici del corto non erano texturizzate tramite immagini bitmap, la colorazione e la risposta alla luce furono gestite tramite surface shaders (programmati nello stile che poi sarebbe diventato standard con RenderMan). Il colore, la riflessione e la risposta all’illuminazione furono calcolati proceduralmente al momento del rendering. John Lasseter animò le pose chiave e il comportamento “caratteriale” delle lampade; Eben Ostby realizzò routine procedurali per compiti ripetitivi — per esempio far ruotare\/rotolare la palla in accordo con la traiettoria disegnata, e farla comportare realisticamente. Luxo Jr. fu un primo esempio pratico di “animatore + computer”: l’animatore mantiene il controllo creativo sui keyframe, il software automatizza i dettagli fisici e ripetitivi.\n",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":5,
    "Personaggio\/soggetto":"Palline da giocoliere",
    "Film\/corto":"Red's Dream",
    "Anno":1987,
    "Regista\/autore":"John Lassater",
    "Trama":"Red è un monociclo rosso abbandonato in un angolo buio e piovoso di un negozio di biciclette. Mentre il negozio chiude, Red sogna di esibirsi in uno spettacolo circense acclamato dal pubblico. Nel suo sogno, un giocoliere entra in scena, ma gli attrezzi cadono; Red li raccoglie e inizia a giocolare con abilità, prendendo il posto della star dello spettacolo. Il sogno finisce bruscamente con un applauso, e Red si risveglia da solo nell'oscurità del negozio, rendendosi conto che la sua vita da star è solo un'illusione.",
    "Link 1":"Cortometraggio: https:\/\/youtu.be\/96xGUa1a_zs?si=Z-9dpkzHtmpj44Yk",
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Movimento",
    "Nome Innovazione":"algoritmo di quadratic programming",
    "Paragrafo descrizione innovazione":"L' algoritmo di quadratic programming calcolava in automatico le traiettorie di movimento delle palline. Dato che il PIC non supportava il Motion Blutr, all'algoritmo viene anche aggiunta la funzionalità di calcolare lo \"squash & stretch\" ovvero la deformazione delle palline quando rimbalzavano per rendere il movimento più realistico. ",
    "Funzionamento - info maggiorni su tecnologie":"In quegli anni pixar utilizzava l’architettura di rendering REYES (“Render Everything You Ever Saw”), la quale concetto chiave era che tutte le geometrie complesse venivano suddivise in “micropoligoni”, su cui poi si facevano operazioni di shading e visibilità. Questo approccio permetteva di gestire scene molto complesse con molti oggetti, perché si “normalizzava” la complessità della geometria a un livello molto fine, era una tecnica molto adatta per rendering ad alta qualità. Il direttore del progetto di Red’s Dream, Ed Catmull, voleva che il corto venisse realizzato utilizzando il loro sistema hardware, la Pixar Image Computer (PIC), e il software di rendering ChapReyes (basato su REYES). Il Pixar Image Computer era un sistema grafico molto avanzato per l’epoca, era stato progettato per elaborazioni parallele, e aveva una banda di memoria e bus elevata. Pur essendo potente presentava dei limiti di memoria critiche per ChapReyes, così era stato ridotto a solo un numero limitato di funzionalità. A causa di queste limitazioni solo la sequenza del sogno è stata effettivamente prodotta interamente con PIC. Le scene del negozio di biciclette erano estremamente complesse: un tipico fotogramma di quelle scene conteneva oltre 10.000 primitive geometriche, che a loro volta erano composte da più di 30 milioni di poligoni. Il vantaggio di ChapReyes era che poteva elaborare tra 50.000 e 100.000 poligoni complessi al minuto, riducendo così notevolmente i tempi di renderizzazione di fotogrammi che comprendevano superficie texturizzata, mappe di texture, fonti di luce multiple e ombre.\nNonostante il sistema PIC fosse potente, dopo la produzione di Red’s Dream, fu deciso di abbandonare questa tecnologia a causa delle sue limitazioni.\n",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":6,
    "Personaggio\/soggetto":"Oggetti\/giocattoli",
    "Film\/corto":"Tin Toy",
    "Anno":1988,
    "Regista\/autore":"John Lassater",
    "Trama":"Un piccolo soldatino di latta, Tinny, è entusiasta di essere il nuovo giocattolo di un bambino, Billy. Tuttavia, Billy si dimostra un bambino distruttivo che lancia e mastica i suoi giocattoli. Spaventato, Tinny si nasconde sotto un divano dove incontra altri giocattoli terrorizzati. Quando il bambino cade e inizia a piangere, Tinny, superando la paura, ritorna per confortarlo, finendo per essere ignorato non appena il bambino trova la scatola che emette musica con cui preferisce giocare. ",
    "Link 1":"Cortometraggio:  https:\/\/youtu.be\/DWi2WTqD59A?si=cA6LzgifuYVyndFN",
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Texture",
    "Nome Innovazione":"Texture On Demand (TOD)",
    "Paragrafo descrizione innovazione":"TOD è una tecnica sviluppata per la gestione grandi quantità di dati texture su disco e caricarli su richiesta (“on demand”) durante il rendering. Le texture non sono memorizzate come un'immagine lineare ma suddivise in tile (tessere) rettangolari di dimensione fissa. Durante il rendering vengono letti e messi in memoria solo i tile necessari, permettendo così un minor consumo di memoria e una riduzione dell’ I\/O (Input e Output), ovvero il flusso di dati delle texture tra i vari componenti hardware e software coinvolti nella creazione di immagini generate al computer. ",
    "Funzionamento - info maggiorni su tecnologie":"L’efficienza di TOD ha permesso di implementare 2 nuove tecniche: Texture Mapping e Bump Mapping. La prima è la tecnica di “mappare” un’immagine (texture) bidimensionale su una superficie 3D, ogni punto della superficie 3D ha una coordinata (u, v) che indica dove prendere il colore dalla texture 2D. La seconda è una tecnica per simulare “rugosità” o sporgenze sulla superficie di un oggetto senza aumentare i poligoni.",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":7,
    "Personaggio\/soggetto":"Billy (neonato)",
    "Film\/corto":"Tin Toy",
    "Anno":1988,
    "Regista\/autore":"John Lassater",
    "Trama":"Un piccolo soldatino di latta, Tinny, è entusiasta di essere il nuovo giocattolo di un bambino, Billy. Tuttavia, Billy si dimostra un bambino distruttivo che lancia e mastica i suoi giocattoli. Spaventato, Tinny si nasconde sotto un divano dove incontra altri giocattoli terrorizzati. Quando il bambino cade e inizia a piangere, Tinny, superando la paura, ritorna per confortarlo, finendo per essere ignorato non appena il bambino trova la scatola che emette musica con cui preferisce giocare. ",
    "Link 1":"Cortometraggio:  https:\/\/youtu.be\/DWi2WTqD59A?si=cA6LzgifuYVyndFN",
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Modellazione",
    "Nome Innovazione":null,
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":null,
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":8,
    "Personaggio\/soggetto":null,
    "Film\/corto":"Knick Knack",
    "Anno":1989,
    "Regista\/autore":"John Lassater",
    "Trama":"Un pupazzo di neve di nome Knick è intrappolato nel suo globo di neve con la scritta \"North Pole\" su una mensola piena di souvenir esotici, tra cui un'attraente statuetta di \"Sunny Miami\". Disperato per la solitudine, Knick tenta comicamente e violentemente di uscire dal suo globo, provando a romperlo con ogni mezzo a sua disposizione senza successo. Alla fine, sfrutta lo scioglimento della neve per far cadere il globo dalla mensola. Finalmente libero, Knick atterra però in un acquario sottostante. Mentre nuota verso una nuova, seducente sirena, la cupola di vetro del suo vecchio globo cade dal ripiano, intrappolandolo nuovamente a pochi centimetri dalla libertà.",
    "Link 1":"Cortometraggio: https:\/\/youtu.be\/1BkcV_wYLC0?si=scGUDUzqgqTWPhQF",
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":null,
    "Nome Innovazione":null,
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":null,
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":9,
    "Personaggio\/soggetto":"Woody",
    "Film\/corto":"Toy Story",
    "Anno":1995,
    "Regista\/autore":"John Lassater",
    "Trama":"Ti sei mai chiesto cosa fanno i giocattoli quando le persone non ci sono? Toy Story risponde a questa domanda con un viaggio fantastico e divertente, visto principalmente attraverso gli occhi di due giocattoli rivali: Woody, il cowboy alto e simpatico, e Buzz Lightyear, il ranger spaziale senza paura. Guidati da Woody, i giocattoli di Andy vivono felici nella sua stanza, finché il compleanno di Andy non porta in scena Buzz Lightyear. Temendo di perdere il suo posto nel cuore di Andy, Woody trama contro Buzz. Ma quando le circostanze separano Buzz e Woody dal loro proprietario, il duo comicamente male assortito impara alla fine a mettere da parte le proprie differenze e si ritrova in un'esilarante missione ricca di avventure, dove l'unico modo per sopravvivere è formare una difficile alleanza.",
    "Link 1":"Teaser: https:\/\/www.youtube.com\/watch?v=QqIRLEg521Y",
    "Link 2":"https:\/\/www.youtube.com\/watch?v=PX1p0lnhQ88",
    "Link 3":null,
    "Categoria Innovazione (tag)":"Modellazione, Luci, Materiale",
    "Nome Innovazione":"Renderman",
    "Paragrafo descrizione innovazione":"RenderMan è stato cruciale in quanto l'unico sistema abbastanza potente da renderizzare l'intero lungometraggio. Ha permesso di ottenere la lucentezza credibile della plastica di personaggi come Buzz Lightyear e la tessitura dei tessuti di Woody, stabilendo uno standard per l'animazione CG cinematografica. ",
    "Funzionamento - info maggiorni su tecnologie":"La sua principale innovazione risiede nel motore REYES, un metodo che scompone le superfici 3D in micropoligoni, calcolando il loro aspetto in modo ottimizzato. Questa efficienza ha reso possibile la produzione di interi lungometraggi in CG. Inoltre, il RenderMan Shading Language (RSL) ha fornito agli artisti un controllo senza precedenti, consentendo di programmare l'interazione tra luce e materiali per ottenere effetti fotorealistici come la lucentezza della plastica e la complessità dei tessuti. RenderMan ha così stabilito lo standard industriale per il rendering cinematografico.",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":10,
    "Personaggio\/soggetto":"Geri",
    "Film\/corto":"Geri's Game",
    "Anno":1997,
    "Regista\/autore":"Jan Pinkava",
    "Trama":"Un anziano brontolone di nome Geri gioca a scacchi contro sé stesso per un'intera giornata al parco. Ad un certo punto, comincia a perdere contro il suo avversario più vivace. Ma proprio quando la partita è quasi finita, Geri riesce a ribaltare la situazione.",
    "Link 1":"Cortometraggio: https:\/\/www.youtube.com\/watch?v=uMVtpCPx8ow",
    "Link 2":"https:\/\/www.youtube.com\/watch?v=2UjfxAuXuSU",
    "Link 3":"https:\/\/www.youtube.com\/watch?v=kC8jbGSiuIQ",
    "Categoria Innovazione (tag)":"Modellazione",
    "Nome Innovazione":"Subdivision Technique",
    "Paragrafo descrizione innovazione":"La Subdivision Surface è una tecnica fondamentale nella computer grafica 3D che permette di ottenere superfici lisce e curve (forme organiche) a partire da una gabbia di controllo poligonale semplice. Invece di modellare le curve manualmente, il software esegue un calcolo automatico che trasforma la geometria di base in una superficie finemente dettagliata. Questa innovazione è stata applicata in modo rivoluzionario nel corto Pixar del 1997, Il gioco di Geri (Geri's Game), dove ha reso possibile la modellazione realistica del volto e delle mani invecchiate del protagonista.",
    "Funzionamento - info maggiorni su tecnologie":"La tecnica si basa su un processo iterativo (spesso basato sull'algoritmo di Catmull-Clark): ad ogni passaggio, la maglia a bassa risoluzione viene suddivisa creando nuovi vertici e poligoni più piccoli. Questi vertici vengono poi spostati e mediati seguendo formule matematiche precise per arrotondare gli angoli e far tendere la superficie alla sua forma curva ideale. Questa tecnica offre una scalabilità efficiente, permettendo un alto livello di dettaglio al momento del rendering pur mantenendo la geometria di base manipolabile.",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":11,
    "Personaggio\/soggetto":"Heimlich",
    "Film\/corto":"A Bug's Life",
    "Anno":1998,
    "Regista\/autore":"John Lasseter, Andrew Stanton",
    "Trama":"Flik è una formica dal pensiero indipendente. L'unico insetto capace di mettere i bastoni tra le ruote alla catena alimentare. Dopo che una delle invenzioni di Flik va terribilmente storta, lui si imbarca in una missione per salvare la colonia da una banda di cavallette scansafatiche e rientrare nelle grazie della Regina. Ma quando il gruppo di \"insetti guerrieri\" reclutato da Flik si rivela essere una goffa compagnia circense, lui deve credere in sé stesso e nelle sue invenzioni per salvare l'Isola delle Formiche una volta per tutte.",
    "Link 1":"Teaser: https:\/\/www.youtube.com\/watch?v=CPen1YcWTgk",
    "Link 2":"Trailer: https:\/\/www.youtube.com\/watch?v=JIOW6TjHrFI",
    "Link 3":"https:\/\/www.youtube.com\/watch?v=KHfMUZ73ybg",
    "Categoria Innovazione (tag)":"Modellazione",
    "Nome Innovazione":"Subdivision Technique",
    "Paragrafo descrizione innovazione":"Nel passaggio da Geri’s Game (1997) a A Bug’s Life(1998), la subdivision technique diventò una componente essenziale della pipeline Pixar, permettendo di dare ai personaggi insettoidi una qualità visiva morbida e continua che sarebbe stata impossibile con i soli poligoni tradizionali dell’epoca. In A Bug’s Life le superfici di suddivisione vennero usate per ottenere corpi arrotondati, privi di spigoli visibili e capaci di deformarsi in modo fluido durante l’animazione. Un esempio emblematico è Heimlich, il bruco del circo: la sua forma segmentata, la pelle liscia e le espressioni esagerate richiedevano una tecnica in grado di mantenere la morbidezza della silhouette anche durante piegamenti estremi e caricature comiche, cosa resa possibile proprio grazie a questa tecnologia.",
    "Funzionamento - info maggiorni su tecnologie":"Le subdivision surfaces applicano iterativamente algoritmi per trasformare una mesh a bassa risoluzione in una superficie liscia e continua, mantenendo però la semplicità del modello di controllo per gli animatori. Questo permise agli artisti di manipolare Heimlich attraverso una struttura relativamente semplice—una serie di volumi principali per testa, torace e segmenti del corpo—mentre il sistema generava automaticamente il livello di dettaglio superiore durante il rendering. La tecnica garantiva quindi non solo un’estetica più organica, ma anche deformazioni più stabili nelle zone critiche, come le pieghe tra i segmenti del bruco, le guance gonfie o la bocca molto mobile, assicurando un’animazione più ricca e credibile senza un carico computazionale ingestibile.",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":12,
    "Personaggio\/soggetto":"Andy\/Buzz Lightyear",
    "Film\/corto":"Toy Story 2",
    "Anno":1999,
    "Regista\/autore":"John Lasseter, Ash Brannon, Lee Unkrich",
    "Trama":"Buzz, Woody e i loro amici tornano mentre Andy parte per il Cowboy Camp, lasciando i suoi giocattoli a cavarsela da soli. La situazione cambia radicalmente quando un ossessivo collezionista di giocattoli di nome Al McWhiggin, proprietario di Al’s Toy Barn, rapisce Woody. Nell’appartamento di Al, Woody scopre di essere un pezzo da collezione di grande valore, proveniente da uno show televisivo degli anni ’50 chiamato “Woody’s Roundup”. Lì conosce anche gli altri preziosi giocattoli della serie: Jessie la cowgirl, Bullseye il cavallo e Stinky Pete il cercatore d’oro. I giocattoli di Andy organizzano una missione di salvataggio audace, Buzz Lightyear trova qualcuno in grado di tenergli testa e Woody deve decidere dove si trova davvero il suo posto — e il suo cuore.",
    "Link 1":"Trailer: https:\/\/www.youtube.com\/watch?v=09qc_4mzGqw",
    "Link 2":"https:\/\/www.youtube.com\/watch?v=AkiEyseaM1k",
    "Link 3":null,
    "Categoria Innovazione (tag)":"Modellazione, Materiale, Texture",
    "Nome Innovazione":"Funzione Shader in Renderman, software Geppetto",
    "Paragrafo descrizione innovazione":"In Toy Story 2, Pixar integrò per la prima volta la funzione Shader in RenderMan per definire l’aspetto finale dei materiali, creando superfici credibili e in particolare una pelle umana più realistica, con aggiunta di un layer di dettagli sopra quello della forma (pori, sudore, nei, lentiggini, imperfezioni). Parallelamente, il sistema interno Geppetto fu impiegato per il rigging e il controllo dei personaggi, permettendo animazioni più complesse e intuitive su Jessie, Stinky Pete, Bullseye e Buzz Lightyear.",
    "Funzionamento - info maggiorni su tecnologie":"Tecnicamente, gli shader calcolano come la luce interagisce con ogni superficie durante il rendering, combinando texture procedurali, mappe di discontinuità e modelli di illuminazione, ottenendo così materiali dettagliati e credibili senza appesantire la modellazione. Geppetto, invece, permette di definire gerarchie di ossa, vincoli, deformatori e controlli ad alto livello: l’animatore manipolava controlli semplici, mentre il software calcolava automaticamente le deformazioni della mesh (skin deformations), semplificando animazioni facciali, movimenti elastici e piegamenti complessi.",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":13,
    "Personaggio\/soggetto":"Uccelli",
    "Film\/corto":"For The Birds",
    "Anno":2000,
    "Regista\/autore":"Ralph Eggleston",
    "Trama":"Uno a uno, uno stormo di piccoli uccelli si posa su un filo del telefono. Stare così vicini comporta già qualche problema, ma poi arriva un grande e goffo uccello che cerca di unirsi a loro. Gli uccelli simili tra loro non possono fare a meno di prenderlo in giro—e alla fine la loro mentalità da branco si rivela imbarazzante.",
    "Link 1":"Cortometraggio: https:\/\/www.youtube.com\/watch?v=DeEZx4K0Eic",
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Modellazione",
    "Nome Innovazione":"Contact pads",
    "Paragrafo descrizione innovazione":"In For the Birds, Pixar voleva che gli uccellini piccoli si schiacciassero l’uno contro l’altro quando non avevano spazio sufficiente sulla linea del telefono, ma senza che le loro mesh si interpenetrassero in modo innaturale. I “contact pads” servono proprio a simulare il contatto fisico: permettono di dare l’illusione che gli uccelli si tocchino e si schiaccino, mantenendo però un controllo preciso delle deformazioni, così da restituire un senso di pressione e volume credibile durante l’animazione.",
    "Funzionamento - info maggiorni su tecnologie":"Bill Wise, supervisore tecnico, creò dei “widget” a forma di dischi flessibili — i contact pads — che venivano inseriti tra gli uccelli. Questi pad erano collegati agli uccelli e gli animatori potevano modellare e animare direttamente la loro forma. Il codice controllava se certi punti della mesh di un uccello si trovassero all’interno della “bounding box” di un pad: quando un punto era dentro, veniva spostato per deformare la superficie del corpo dell’uccello secondo la forma definita dal pad. Questo sistema permetteva a due uccelli vicini di schiacciarsi contro lo stesso pad e deformarsi di conseguenza, mantenendo un’interazione realistica.",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":14,
    "Personaggio\/soggetto":"Sully e Boo",
    "Film\/corto":"Monsters & Co.",
    "Anno":2001,
    "Regista\/autore":"Pete Docter, Lee Unkrich, David Silverman",
    "Trama":"C’è un motivo per cui ci sono i mostri negli armadi dei bambini: è il loro lavoro. Monsters, Inc. è la fabbrica di elaborazione delle urla più efficiente del mondo dei mostri, e non c’è Spaventatore migliore di James P. Sullivan. Ma quando “Sulley” lascia accidentalmente entrare una piccola bambina umana a Monstropolis, la sua vita e quella del suo amico Mike vengono sconvolte.",
    "Link 1":"Teaser: https:\/\/www.youtube.com\/watch?v=86kC3rMFFq4",
    "Link 2":"Trailer: https:\/\/www.youtube.com\/watch?v=LF6X4W_OQr8",
    "Link 3":"https:\/\/www.youtube.com\/watch?v=XzLp5GQ9AnE",
    "Categoria Innovazione (tag)":"Movimento",
    "Nome Innovazione":"Simulation, Fizt",
    "Paragrafo descrizione innovazione":"Simulation veniva applicato alla pelliccia di Sulley, permettendo ai suoi oltre 2,3 milioni di peli di reagire in modo realistico ai movimenti del corpo e all’interazione con l’ambiente, garantendo un aspetto naturale durante salti, corse o contatti con altri personaggi. Fizt, invece, fu cruciale per animare la maglietta di Boo e altri indumenti: prima di Monsters, Inc., i vestiti nei film Pixar seguivano rigidamente il movimento del corpo senza avere una dinamica propria, mentre Fizt permise di trattare i vestiti come entità separate, simulando pieghe, oscillazioni e interazioni con i movimenti dei personaggi in modo credibile.",
    "Funzionamento - info maggiorni su tecnologie":"Simulation è basato su algoritmi di dinamica dei peli e delle fibre che calcolano le forze e le interazioni tra ciascun pelo, la gravità e l’inerzia, così da reagire automaticamente ai movimenti del personaggio e agli oggetti circostanti. Questo sistema genera deformazioni realistiche senza la necessità di animare manualmente ogni singolo pelo, garantendo coerenza visiva e risparmiando tempo agli animatori. Fizt, invece, funziona come un simulatore di tessuti: ogni capo di abbigliamento o elemento separato viene trattato come un oggetto fisico con massa, attrito e vincoli. Il software calcola la risposta dei vestiti ai movimenti del corpo, alle collisioni con altri oggetti e alla gravità, consentendo a Boo e alla sua maglietta di muoversi indipendentemente dal modello del corpo sottostante.",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":15,
    "Personaggio\/soggetto":"Mike Wasowski",
    "Film\/corto":"La Nuova Macchina di Mike",
    "Anno":2001,
    "Regista\/autore":"Pete Docter, Roger Gould",
    "Trama":"Mike scopre che essere il miglior raccoglitore di risate di Monsters, Inc. ha i suoi vantaggi—come guadagnare abbastanza soldi per comprare un’auto a sei ruote piena di gadget. Tuttavia, il profumo di macchina nuova dura poco, perché Sulley dà il via a un test su strada sfortunato che insegna a Mike il vero significato del rimorso dell’acquirente.",
    "Link 1":"Cortometraggio: https:\/\/www.youtube.com\/watch?v=zfC_GuHiP68",
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":null,
    "Nome Innovazione":null,
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":null,
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":16,
    "Personaggio\/soggetto":"Meduse",
    "Film\/corto":"Alla Scoperta di Nemo",
    "Anno":2003,
    "Regista\/autore":"Andrew Stanton",
    "Trama":"Nelle colorate e calde acque tropicali della Grande Barriera Corallina, un pesce pagliaccio di nome Marlin vive sicuro e appartato nella sua anemone insieme al suo unico figlio, Nemo. Timoroso dell’oceano e dei suoi rischi imprevedibili, Marlin lotta per proteggere il figlio. Nemo, come tutti i giovani pesci, è desideroso di esplorare il misterioso reef. Quando Nemo viene improvvisamente portato lontano da casa e rinchiuso nell’acquario kitsch dello studio di un dentista, Marlin si trova suo malgrado a diventare l’eroe di un’epica avventura per salvare il figlio.",
    "Link 1":"Teaser: https:\/\/www.youtube.com\/watch?v=GraVZbADTRY",
    "Link 2":"Trailer: https:\/\/www.youtube.com\/watch?v=VtZ6C3M0q28",
    "Link 3":"https:\/\/www.youtube.com\/watch?v=Ir9HKm5nbW4",
    "Categoria Innovazione (tag)":"Luci",
    "Nome Innovazione":"Transblurrency",
    "Paragrafo descrizione innovazione":"Pixar introdusse per la prima volta in modo estensivo due tecniche avanzate di rendering per ottenere un aspetto realistico dell’ambiente subacqueo e dei personaggi: Transblurrency e Subsurface Scattering. La Transblucency venne utilizzata per simulare la luce filtrata dall’acqua e dagli oggetti semitrasparenti come le meduse, rendendo l’illuminazione e il colore più realistici in relazione alla profondità e alla distanza della telecamera. Il Subsurface Scattering servì invece a riprodurre la diffusione della luce all’interno dei materiali organici, come la pelle dei pesci e le squame dei coralli, conferendo ai personaggi un aspetto morbido, luminoso e tridimensionale.",
    "Funzionamento - info maggiorni su tecnologie":"La Transblurrency calcola come la luce passi attraverso oggetti semitrasparenti, sfumando il background in funzione della distanza e della profondità e adattando l’intensità luminosa in base al percorso dei raggi e alla posizione della telecamera. Il Subsurface Scattering simula il comportamento della luce all’interno di materiali organici: la luce penetra, si diffonde internamente e riemerge in un punto diverso, creando un effetto di morbidezza e traslucenza che rende i corpi dei personaggi più realistici. L’integrazione di queste due tecniche permise a Pixar di ottenere ambienti e personaggi con un livello di realismo visivo mai raggiunto prima, rendendo convincente l’interazione della luce con l’acqua e i materiali organici.",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":17,
    "Personaggio\/soggetto":"Merida",
    "Film\/corto":"Brave",
    "Anno":2012,
    "Regista\/autore":"Mark Andrews, Brenda Chapman, Steve Purcell",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Movimento",
    "Nome Innovazione":"Taz",
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":"per gestire le singole ciocche di capelli ricci",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":18,
    "Personaggio\/soggetto":null,
    "Film\/corto":"Brave",
    "Anno":2012,
    "Regista\/autore":"Mark Andrews, Brenda Chapman, Steve Purcell",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Movimento",
    "Nome Innovazione":"Presto",
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":"usato qui per il primo lungometraggio, evoluzione di Geppetto",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":19,
    "Personaggio\/soggetto":"Queen Elinor",
    "Film\/corto":"Brave",
    "Anno":2012,
    "Regista\/autore":"Mark Andrews, Brenda Chapman, Steve Purcell",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Materiali",
    "Nome Innovazione":"Loom Technology",
    "Paragrafo descrizione innovazione":"tesse ogni filo di tessuto virtuale in un software di ombreggiatura per conferire maggiore dettaglio ai tessuti",
    "Funzionamento - info maggiorni su tecnologie":"shading software per stoffe",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":20,
    "Personaggio\/soggetto":"Ambientazioni",
    "Film\/corto":"Monsters University",
    "Anno":2013,
    "Regista\/autore":"Dan Scanlon",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Luci",
    "Nome Innovazione":"Global illumination",
    "Paragrafo descrizione innovazione":"modella la naturale distribuzione delle luci in una scena basandosi sulla fisica del mondo reale",
    "Funzionamento - info maggiorni su tecnologie":"nuovo sistema di illuminazione, per permettere di concentrarsi su luci artistiche (ad esempio per suscitare spavento)",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":21,
    "Personaggio\/soggetto":"Gioia",
    "Film\/corto":"Inside Out",
    "Anno":2015,
    "Regista\/autore":"Pete Docter, Ronnie del Carmen",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Luci e Movimento",
    "Nome Innovazione":"Geolight (o geometric area lights)",
    "Paragrafo descrizione innovazione":"effetto di RenderMan per permettere a un personaggio di emettere luce anche mentre si muove",
    "Funzionamento - info maggiorni su tecnologie":"per permettere a un personaggio di emettere luce ",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":22,
    "Personaggio\/soggetto":"Nuvole",
    "Film\/corto":"The Good Dinosaur",
    "Anno":2015,
    "Regista\/autore":"Peter Sohn",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Sfondo",
    "Nome Innovazione":"Cloud Lego Parts (libreria elementi volumetrici)",
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":"per avere nuvole 3d di tutte le tipologie che rendano l'atmosfera più immersiva",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":23,
    "Personaggio\/soggetto":"Hank",
    "Film\/corto":"Finding Dory",
    "Anno":2016,
    "Regista\/autore":"Andrew Stanton, Angus MacLane",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Movimento",
    "Nome Innovazione":"CoDE (Component Deformation Engine) + Volumetric simulation",
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":"per rendere l'estrema flessibilità di personaggi senza scheletro",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":24,
    "Personaggio\/soggetto":"Louise Nash",
    "Film\/corto":"Cars 3",
    "Anno":2017,
    "Regista\/autore":"Brian Fee",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Materiali",
    "Nome Innovazione":"Bump Roughness Mapping",
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":"per invecchiamento dei materiali, per mantenere il dettaglio anche a distanza",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":25,
    "Personaggio\/soggetto":"Miguel",
    "Film\/corto":"Coco",
    "Anno":2017,
    "Regista\/autore":"Lee Unkrich",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":null,
    "Nome Innovazione":"Kingpin ?",
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":null,
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":26,
    "Personaggio\/soggetto":"Scheletri",
    "Film\/corto":"Coco",
    "Anno":2017,
    "Regista\/autore":"Lee Unkrich",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Materiali",
    "Nome Innovazione":"Continous Collision Detection (tecnica di simulazione)",
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":"per vestire personaggi complessi come scheletri",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":27,
    "Personaggio\/soggetto":"Personagi sullo sfondo",
    "Film\/corto":"The Incredibles 2",
    "Anno":2018,
    "Regista\/autore":"Brad Bird",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Movimento \/Sfondo",
    "Nome Innovazione":"Motion Capture ",
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":"per esseri umani sullo sfondo",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":28,
    "Personaggio\/soggetto":null,
    "Film\/corto":"The Incredibles 3",
    "Anno":2018,
    "Regista\/autore":"Brad Bird",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":null,
    "Nome Innovazione":"gLux (generalized Lux shading system)",
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":null,
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":29,
    "Personaggio\/soggetto":"Elastigirl",
    "Film\/corto":"The Incredibles 4",
    "Anno":2018,
    "Regista\/autore":"Brad Bird",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Materiali",
    "Nome Innovazione":"3D UV-scaling",
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":"per mantenere i dettagli su vestiti\/tessuti che vengono allungati o compressi ",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":30,
    "Personaggio\/soggetto":"Giocattoli del negozio di antiquariato",
    "Film\/corto":"Toy Story 4",
    "Anno":2019,
    "Regista\/autore":"Josh Cooley",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Movimento \/ Sfondo",
    "Nome Innovazione":"Motion Capture ",
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":"per gestire un grande numero di pezzi",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":31,
    "Personaggio\/soggetto":"Wilden Lightfoot (il papà)",
    "Film\/corto":"Onward",
    "Anno":2020,
    "Regista\/autore":"Dan Scanlon",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Movimento",
    "Nome Innovazione":"Hybrid Simulation-Animation Rig",
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":"per gestire un personaggio con metà corpo",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":32,
    "Personaggio\/soggetto":"Joe",
    "Film\/corto":"Soul",
    "Anno":2020,
    "Regista\/autore":"Pete Docter, Kemp Powers",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Movimento",
    "Nome Innovazione":"Finger Contact Rig",
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":"per suonare il pianoforte",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":33,
    "Personaggio\/soggetto":"Jerry e Terry",
    "Film\/corto":"Soul",
    "Anno":2020,
    "Regista\/autore":"Pete Docter, Kemp Powers",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":null,
    "Nome Innovazione":null,
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":null,
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":34,
    "Personaggio\/soggetto":"Luca",
    "Film\/corto":"Luca",
    "Anno":2021,
    "Regista\/autore":"Enrico Casarosa",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Movimento",
    "Nome Innovazione":"Transformation Rig",
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":"per la transizione umano-mostro marino",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":35,
    "Personaggio\/soggetto":"Alberto",
    "Film\/corto":"Luca",
    "Anno":2021,
    "Regista\/autore":"Enrico Casarosa",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Movimento",
    "Nome Innovazione":"Transformation Rig",
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":"per la transizione umano-mostro marino",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":36,
    "Personaggio\/soggetto":null,
    "Film\/corto":"Turning Red",
    "Anno":2022,
    "Regista\/autore":"Domee Shi",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":null,
    "Nome Innovazione":null,
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":null,
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":37,
    "Personaggio\/soggetto":null,
    "Film\/corto":"Lightyear",
    "Anno":2022,
    "Regista\/autore":"Angus MacLane",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":null,
    "Nome Innovazione":null,
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":null,
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":38,
    "Personaggio\/soggetto":"Ember",
    "Film\/corto":"Elemental",
    "Anno":2023,
    "Regista\/autore":"Peter Sohn",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Movimento",
    "Nome Innovazione":"Volumetric Neural Style Transfer",
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":"per simulare espressività delle fiamme",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":39,
    "Personaggio\/soggetto":null,
    "Film\/corto":"Inside Out 2",
    "Anno":2024,
    "Regista\/autore":"Kelsey Mann",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":null,
    "Nome Innovazione":null,
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":null,
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  },
  {
    "ID":40,
    "Personaggio\/soggetto":null,
    "Film\/corto":"Elio",
    "Anno":2025,
    "Regista\/autore":"Adrian Molina, Domee Shi, Madeline Sharafian",
    "Trama":null,
    "Link 1":null,
    "Link 2":null,
    "Link 3":null,
    "Categoria Innovazione (tag)":"Luci",
    "Nome Innovazione":"Luna",
    "Paragrafo descrizione innovazione":null,
    "Funzionamento - info maggiorni su tecnologie":"per creare un mondo abbagliante era necessario avere l'illuminazione durante tutto il processo di produzione e non solo nella fase finale",
    "Copertina":null,
    "Img01":null,
    "Img02":null,
    "Img03":null,
    "Img04":null,
    "Img05":null,
    "Img06":null,
    "Img07":null,
    "Img08":null,
    "Img09":null,
    "Img10":null
  }
]